In [1]:
import  pandas as pd
import numpy as np

In [3]:
test_dict = {
    'Corey' : [ 63,75,88 ],
    'Kevin' : [ 48,98,92 ],
    'Akshay': [ 87,86,85 ]
}

In [17]:
#  Create dataFrame
df = pd.DataFrame(test_dict)

In [18]:
# Show the DataFrame
df

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

In [19]:
#  T = Transfo
df = df.T
print(df.T) # To flip column into row aand row into column

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

In [21]:
# Renaming Columns

df.columns = ['Quiz1', 'Quiz2', 'Quiz3']
df

        Quiz1  Quiz2  Quiz3
Corey      63     75     88
Kevin      48     98     92
Akshay     87     86     85

In [22]:
#  Access First Row  by Index

df.iloc[0]

Quiz1    63
Quiz2    75
Quiz3    88
Name: Corey, dtype: int64

In [23]:
# Seccond Row
df.iloc[1]

Quiz1    48
Quiz2    98
Quiz3    92
Name: Kevin, dtype: int64

In [24]:
#  last Column
df.iloc[-1]

Quiz1    87
Quiz2    86
Quiz3    85
Name: Akshay, dtype: int64

In [27]:
#  Access First Column using Column name

df
df['Quiz1']

Corey     63
Kevin     48
Akshay    87
Name: Quiz1, dtype: int64

In [43]:
# Access First column  using dot
df.Quiz1

AttributeError: 'DataFrame' object has no attribute 'Quiz1'

In [40]:
# df = df.T
# Limit DataFrame to first 2 rows
df[0:2]

       Corey  Kevin  Akshay
Quiz1     63     48      87
Quiz2     75     98      86

In [42]:
#  Define new set for rows and cols

rows = ['Corey', 'Kevin']
cols = ['Quiz2', 'Quiz3']

df_spring = df.loc[rows, cols]
print(df_spring)

KeyError: "None of [Index(['Corey', 'Kevin'], dtype='object')] are in the [index]"

In [44]:
#  Get First 2 Rows and Last 2 Cols using index

df.iloc[[0,1], [1,2]]

       Kevin  Akshay
Quiz1     48      87
Quiz2     98      86

In [49]:
#  Define new column as mean of other column

df['Quiz_Avg_New' ] = df.mean(axis=1)

In [50]:
print(df)

       Corey  Kevin  Akshay   Quiz_Avg  Quiz_Avg_New
Quiz1     63     48      87  66.000000     66.000000
Quiz2     75     98      86  86.333333     86.333333
Quiz3     88     92      85  88.333333     88.333333

In [51]:
#  Add new Quiz 4
df['Quiz_4'] = [92,95,88]
df

       Corey  Kevin  Akshay   Quiz_Avg  Quiz_Avg_New  Quiz_4
Quiz1     63     48      87  66.000000     66.000000      92
Quiz2     75     98      86  86.333333     86.333333      95
Quiz3     88     92      85  88.333333     88.333333      88

In [54]:
#  Deleting A Column
del df['Quiz_4']

In [55]:
print(df)

       Corey  Kevin  Akshay   Quiz_Avg
Quiz1     63     48      87  66.000000
Quiz2     75     98      86  86.333333
Quiz3     88     92      85  88.333333

In [63]:
# Create dictionary of test scores
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]}
# Create DataFrame
df = pd.DataFrame(test_dict)

In [64]:
df = df.T
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [65]:
# Rename Columns
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [66]:

df['Quiz_4'] = [92, 95, 88]
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88

In [67]:
import numpy as np

In [68]:
# Create new DataFrame of one row
df_new = pd.DataFrame({'Quiz_1':[np.NaN], 'Quiz_2':[np.NaN], 'Quiz_3': [np.NaN], 'Quiz_4':[71]}, index=['Adrian'])
df_new

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Adrian     NaN     NaN     NaN      71